MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_ADSB_1090/Arhiv/FlyRf_Base_26_04_28_14/ADSBReceiverESP32.cpp
#include "ADSBReceiverESP32.h"

#include <esp_task_wdt.h>
#include <math.h>
#include <soc/gpio_reg.h>
#include <soc/soc.h>
#include <string.h>
#include <xtensa/core-macros.h>

#if __has_include(<esp_arduino_version.h>)
#include <esp_arduino_version.h>
#endif

#if ADSB_ESP32_DMA_CAPTURE && __has_include(<driver/i2s.h>)
#include <driver/i2s.h>
#include <esp_intr_alloc.h>
#define ADSB_ESP32_HAS_I2S_DMA 1
#else
#define ADSB_ESP32_HAS_I2S_DMA 0
#endif

#include "Container.h"
#include "EEPROMRF.h"
#include "TrafficTypes.h"

#ifndef ESP_ARDUINO_VERSION_MAJOR
#define ESP_ARDUINO_VERSION_MAJOR 2
#endif

namespace
{
    constexpr size_t kMaxSlots = 260;
    constexpr size_t kMaxAircraft = 48;
    constexpr uint32_t kCPRMaxPairAgeMs = 30000UL;
    constexpr uint16_t kPreambleSlots = 16;
    constexpr uint16_t kLongFrameDataSlots = 224;
    constexpr uint16_t kFullSampleSlots = kPreambleSlots + kLongFrameDataSlots;
    constexpr uint8_t kPhaseCount = 3;
    constexpr uint8_t kPhaseCenter = 1;
    constexpr uint32_t kDmaBitRateHz = ADSB_ESP32_DMA_BIT_RATE_HZ;
    constexpr uint8_t kDmaSamplesPerHalfSlot = (kDmaBitRateHz / 2000000UL);
    constexpr size_t kDmaReadWords = 512;
    constexpr size_t kDmaMaxCandidatesPerChunk = 24;
    constexpr uint32_t kPollSliceUs = 2500UL;
    constexpr uint32_t kThresholdPwmFreqHz = 10000UL;
    constexpr uint8_t kThresholdPwmResolutionBits = 12;
    constexpr uint16_t kThresholdPwmMaxDuty = (1U << kThresholdPwmResolutionBits) - 1U;
    constexpr int32_t kThresholdMinMv = 300;
    constexpr int32_t kThresholdMaxMv = 1400;
    constexpr int32_t kThresholdMinDuty8 = 10;
    constexpr int32_t kThresholdMaxDuty8 = 130;
    constexpr uint8_t kCrcConfirmHits = ADSB_ESP32_CRC_CONFIRM_HITS;
    constexpr uint32_t kCrcConfirmWindowMs = 10000UL;
    constexpr uint32_t kApTrustWindowMs = 30000UL;
#if ESP_ARDUINO_VERSION_MAJOR < 3
    constexpr uint8_t kThresholdPwmChannel = 7;
#endif

    struct DecodedModeSFrame
    {
        uint8_t bytes[14];
        uint8_t byteLen;
        uint8_t bitLen;
        uint8_t df;
        uint32_t address;
        uint32_t syndrome;
        bool crcSelfValid;
        bool addressParityValid;
        uint8_t phase;
        uint8_t preambleOffset;
        uint8_t preambleMismatches;
    };

    struct CPRPacket
    {
        uint32_t lat;
        uint32_t lon;
        uint32_t timestampMs;
        bool valid;
    };

    struct AdsbAircraftState
    {
        uint32_t address;
        char callsign[8];
        int altitudeFt;
        int squawk;
        float speedKts;
        float courseDeg;
        int verticalRateFpm;
        float latitude;
        float longitude;
        CPRPacket even;
        CPRPacket odd;
        uint32_t lastSeenMs;
        bool hasCallsign;
        bool hasAltitude;
        bool hasSquawk;
        bool hasVelocity;
        bool hasPosition;
        bool crcConfirmed;
        uint8_t crcHitCount;
        uint32_t crcFirstSeenMs;
        uint32_t lastCrcMs;
    };

    static ADSBReceiverESP32Diag g_diag = {};
    static TaskHandle_t g_adsbTask = nullptr;
    static TaskHandle_t g_dmaTask = nullptr;
    static AdsbAircraftState g_aircraft[kMaxAircraft] = {};
    static volatile uint32_t g_cyclesPerUs = 240UL;
    static volatile uint32_t g_cyclesPerHalfUs = 120UL;
    static volatile uint32_t g_cyclesPerQuarterUs = 60UL;
    static volatile bool g_dmaCaptureActive = false;
    static bool g_thresholdPwmReady = false;
    static uint16_t g_lastThresholdPwmDuty = 0xFFFFU;

    static uint16_t thresholdSettingToDuty()
    {
        int32_t level = settings ? settings->threshold_level : 910;
        if (level < kThresholdMinMv) level = kThresholdMinMv;
        if (level > kThresholdMaxMv) level = kThresholdMaxMv;
        const int32_t duty8 = kThresholdMinDuty8 +
            (((level - kThresholdMinMv) * (kThresholdMaxDuty8 - kThresholdMinDuty8)) /
             (kThresholdMaxMv - kThresholdMinMv));
        return (uint16_t)((duty8 * kThresholdPwmMaxDuty + 127) / 255);
    }

    static bool setupThresholdPwm()
    {
        if (g_thresholdPwmReady)
        {
            return true;
        }

        pinMode(ADSB_ESP32_THRESHOLD_PWM_PIN, OUTPUT);
#if ESP_ARDUINO_VERSION_MAJOR >= 3
        g_thresholdPwmReady = ledcAttach(ADSB_ESP32_THRESHOLD_PWM_PIN, kThresholdPwmFreqHz, kThresholdPwmResolutionBits);
#else
        ledcSetup(kThresholdPwmChannel, kThresholdPwmFreqHz, kThresholdPwmResolutionBits);
        ledcAttachPin(ADSB_ESP32_THRESHOLD_PWM_PIN, kThresholdPwmChannel);
        g_thresholdPwmReady = true;
#endif
        return g_thresholdPwmReady;
    }

    static void writeThresholdPwm(uint16_t duty)
    {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
        ledcWrite(ADSB_ESP32_THRESHOLD_PWM_PIN, duty);
#else
        ledcWrite(kThresholdPwmChannel, duty);
#endif
    }

    static const uint32_t crc24_table[256] = {
        0x0, 0xFFF409, 0x1C1B, 0xFFE812, 0x3836, 0xFFCC3F, 0x242D, 0xFFD024, 0x706C, 0xFF8465, 0x6C77, 0xFF987E, 0x485A,
        0xFFBC53, 0x5441, 0xFFA048, 0xE0D8, 0xFF14D1, 0xFCC3, 0xFF08CA, 0xD8EE, 0xFF2CE7, 0xC4F5, 0xFF30FC, 0x90B4, 0xFF64BD,
        0x8CAF, 0xFF78A6, 0xA882, 0xFF5C8B, 0xB499, 0xFF4090, 0x1C1B0, 0xFE35B9, 0x1DDAB, 0xFE29A2, 0x1F986, 0xFE0D8F,
        0x1E59D, 0xFE1194, 0x1B1DC, 0xFE45D5, 0x1ADC7, 0xFE59CE, 0x189EA, 0xFE7DE3, 0x195F1, 0xFE61F8, 0x12168, 0xFED561,
        0x13D73, 0xFEC97A, 0x1195E, 0xFEED57, 0x10545, 0xFEF14C, 0x15104, 0xFEA50D, 0x14D1F, 0xFEB916, 0x16932, 0xFE9D3B,
        0x17529, 0xFE8120, 0x38360, 0xFC7769, 0x39F7B, 0xFC6B72, 0x3BB56, 0xFC4F5F, 0x3A74D, 0xFC5344, 0x3F30C, 0xFC0705,
        0x3EF17, 0xFC1B1E, 0x3CB3A, 0xFC3F33, 0x3D721, 0xFC2328, 0x363B8, 0xFC97B1, 0x37FA3, 0xFC8BAA, 0x35B8E, 0xFCAF87,
        0x34795, 0xFCB39C, 0x313D4, 0xFCE7DD, 0x30FCF, 0xFCFBC6, 0x32BE2, 0xFCDFEB, 0x337F9, 0xFCC3F0, 0x242D0, 0xFDB6D9,
        0x25ECB, 0xFDAAC2, 0x27AE6, 0xFD8EEF, 0x266FD, 0xFD92F4, 0x232BC, 0xFDC6B5, 0x22EA7, 0xFDDAAE, 0x20A8A, 0xFDFE83,
        0x21691, 0xFDE298, 0x2A208, 0xFD5601, 0x2BE13, 0xFD4A1A, 0x29A3E, 0xFD6E37, 0x28625, 0xFD722C, 0x2D264, 0xFD266D,
        0x2CE7F, 0xFD3A76, 0x2EA52, 0xFD1E5B, 0x2F649, 0xFD0240, 0x706C0, 0xF8F2C9, 0x71ADB, 0xF8EED2, 0x73EF6, 0xF8CAFF,
        0x722ED, 0xF8D6E4, 0x776AC, 0xF882A5, 0x76AB7, 0xF89EBE, 0x74E9A, 0xF8BA93, 0x75281, 0xF8A688, 0x7E618, 0xF81211,
        0x7FA03, 0xF80E0A, 0x7DE2E, 0xF82A27, 0x7C235, 0xF8363C, 0x79674, 0xF8627D, 0x78A6F, 0xF87E66, 0x7AE42, 0xF85A4B,
        0x7B259, 0xF84650, 0x6C770, 0xF93379, 0x6DB6B, 0xF92F62, 0x6FF46, 0xF90B4F, 0x6E35D, 0xF91754, 0x6B71C, 0xF94315,
        0x6AB07, 0xF95F0E, 0x68F2A, 0xF97B23, 0x69331, 0xF96738, 0x627A8, 0xF9D3A1, 0x63BB3, 0xF9CFBA, 0x61F9E, 0xF9EB97,
        0x60385, 0xF9F78C, 0x657C4, 0xF9A3CD, 0x64BDF, 0xF9BFD6, 0x66FF2, 0xF99BFB, 0x673E9, 0xF987E0, 0x485A0, 0xFB71A9,
        0x499BB, 0xFB6DB2, 0x4BD96, 0xFB499F, 0x4A18D, 0xFB5584, 0x4F5CC, 0xFB01C5, 0x4E9D7, 0xFB1DDE, 0x4CDFA, 0xFB39F3,
        0x4D1E1, 0xFB25E8, 0x46578, 0xFB9171, 0x47963, 0xFB8D6A, 0x45D4E, 0xFBA947, 0x44155, 0xFBB55C, 0x41514, 0xFBE11D,
        0x4090F, 0xFBFD06, 0x42D22, 0xFBD92B, 0x43139, 0xFBC530, 0x54410, 0xFAB019, 0x5580B, 0xFAAC02, 0x57C26, 0xFA882F,
        0x5603D, 0xFA9434, 0x5347C, 0xFAC075, 0x52867, 0xFADC6E, 0x50C4A, 0xFAF843, 0x51051, 0xFAE458, 0x5A4C8, 0xFA50C1,
        0x5B8D3, 0xFA4CDA, 0x59CFE, 0xFA68F7, 0x580E5, 0xFA74EC, 0x5D4A4, 0xFA20AD, 0x5C8BF, 0xFA3CB6, 0x5EC92, 0xFA189B,
        0x5F089, 0xFA0480
    };

    static uint32_t crc24Bytes(const uint8_t* buffer, uint8_t len)
    {
        uint32_t crc = 0;
        for (uint8_t i = 0; i < len; ++i)
        {
            const uint8_t byte = buffer[i];
            crc = ((crc << 8) ^ crc24_table[((crc >> 16) ^ byte) & 0xFF]) & 0xFFFFFFUL;
        }
        return crc & 0xFFFFFFUL;
    }

