MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_ADSB_1090/Arhiv/FlyRf_Base_26_04_28_14/ADSBReceiverESP32.cpp
    static uint32_t getBits(const uint8_t* bytes, uint16_t firstBit, uint8_t count)
    {
        uint32_t value = 0;
        for (uint8_t i = 0; i < count; ++i)
        {
            const uint16_t bitIndex = firstBit + i;
            const uint8_t b = bytes[bitIndex / 8];
            const uint8_t bit = (b >> (7 - (bitIndex & 7))) & 1U;
            value = (value << 1) | bit;
        }
        return value;
    }

    static bool isLongDf(uint8_t df)
    {
        return df == 16 || df == 17 || df == 18 || df == 19 || df == 20 || df == 21 || df == 24;
    }

    static bool isAddressParityDf(uint8_t df)
    {
        return df == 4 || df == 5 || df == 20 || df == 21;
    }

    static bool frameParityAccepted(const DecodedModeSFrame& frame)
    {
        return frame.crcSelfValid || frame.addressParityValid;
    }

    static int cprNL(float lat)
    {
        const float a = fabsf(lat);
        if (a < 10.47047130f) return 59;
        if (a < 14.82817437f) return 58;
        if (a < 18.18626357f) return 57;
        if (a < 21.02939493f) return 56;
        if (a < 23.54504487f) return 55;
        if (a < 25.82924707f) return 54;
        if (a < 27.93898710f) return 53;
        if (a < 29.91135686f) return 52;
        if (a < 31.77209708f) return 51;
        if (a < 33.53993436f) return 50;
        if (a < 35.22899598f) return 49;
        if (a < 36.85025108f) return 48;
        if (a < 38.41241892f) return 47;
        if (a < 39.92256684f) return 46;
        if (a < 41.38651832f) return 45;
        if (a < 42.80914012f) return 44;
        if (a < 44.19454951f) return 43;
        if (a < 45.54626723f) return 42;
        if (a < 46.86733252f) return 41;
        if (a < 48.16039128f) return 40;
        if (a < 49.42776439f) return 39;
        if (a < 50.67150166f) return 38;
        if (a < 51.89342469f) return 37;
        if (a < 53.09516153f) return 36;
        if (a < 54.27817472f) return 35;
        if (a < 55.44378444f) return 34;
        if (a < 56.59318756f) return 33;
        if (a < 57.72747354f) return 32;
        if (a < 58.84763776f) return 31;
        if (a < 59.95459277f) return 30;
        if (a < 61.04917774f) return 29;
        if (a < 62.13216659f) return 28;
        if (a < 63.20427479f) return 27;
        if (a < 64.26616523f) return 26;
        if (a < 65.31845310f) return 25;
        if (a < 66.36171008f) return 24;
        if (a < 67.39646774f) return 23;
        if (a < 68.42322022f) return 22;
        if (a < 69.44242631f) return 21;
        if (a < 70.45451075f) return 20;
        if (a < 71.45986473f) return 19;
        if (a < 72.45884545f) return 18;
        if (a < 73.45177442f) return 17;
        if (a < 74.43893416f) return 16;
        if (a < 75.42056257f) return 15;
        if (a < 76.39684391f) return 14;
        if (a < 77.36789461f) return 13;
        if (a < 78.33374083f) return 12;
        if (a < 79.29428225f) return 11;
        if (a < 80.24923213f) return 10;
        if (a < 81.19801349f) return 9;
        if (a < 82.13956981f) return 8;
        if (a < 83.07199445f) return 7;
        if (a < 83.99173563f) return 6;
        if (a < 84.89166191f) return 5;
        if (a < 85.75541621f) return 4;
        if (a < 86.53536998f) return 3;
        if (a < 87.00000000f) return 2;
        return 1;
    }

    static int positiveMod(int value, int divisor)
    {
        int result = value % divisor;
        return result < 0 ? result + divisor : result;
    }

    static float wrapLongitude(float lon)
    {
        while (lon > 180.0f) lon -= 360.0f;
        while (lon < -180.0f) lon += 360.0f;
        return lon;
    }

    static bool decodeGlobalCPR(const CPRPacket& even, const CPRPacket& odd, float& outLat, float& outLon)
    {
        if (!even.valid || !odd.valid)
        {
            return false;
        }

        const uint32_t pairAge = (even.timestampMs > odd.timestampMs)
            ? (even.timestampMs - odd.timestampMs)
            : (odd.timestampMs - even.timestampMs);
        if (pairAge > kCPRMaxPairAgeMs)
        {
            return false;
        }

        const float latEven = (float)even.lat / 131072.0f;
        const float latOdd = (float)odd.lat / 131072.0f;
        const int j = (int)floorf((59.0f * latEven) - (60.0f * latOdd) + 0.5f);

        float rlatEven = (360.0f / 60.0f) * ((float)positiveMod(j, 60) + latEven);
        float rlatOdd = (360.0f / 59.0f) * ((float)positiveMod(j, 59) + latOdd);
        if (rlatEven >= 270.0f) rlatEven -= 360.0f;
        if (rlatOdd >= 270.0f) rlatOdd -= 360.0f;
        if (cprNL(rlatEven) != cprNL(rlatOdd))
        {
            return false;
        }

        const bool useOdd = odd.timestampMs > even.timestampMs;
        const float lat = useOdd ? rlatOdd : rlatEven;
        const int nl = cprNL(lat);
        const int ni = useOdd ? ((nl > 1) ? (nl - 1) : 1) : ((nl > 0) ? nl : 1);
        const float lonEven = (float)even.lon / 131072.0f;
        const float lonOdd = (float)odd.lon / 131072.0f;
        const int m = (int)floorf(((float)(nl - 1) * lonEven) - ((float)nl * lonOdd) + 0.5f);
        const float lonCpr = useOdd ? lonOdd : lonEven;
        const float lon = (360.0f / (float)ni) * ((float)positiveMod(m, ni) + lonCpr);

        outLat = lat;
        outLon = wrapLongitude(lon);
        return true;
    }

    static int decodeAltitudeFt(uint16_t ac12)
    {
        if (ac12 == 0)
        {
            return 0;
        }

        const bool qBit = (ac12 & 0x0010U) != 0;
        const uint16_t n = (uint16_t)(((ac12 & 0x0FE0U) >> 1) | (ac12 & 0x000FU));
        return qBit ? ((int)n * 25 - 1000) : ((int)n * 25);
    }

    static int decodeAltitudeModeS13Ft(uint16_t ac13)
    {
        return decodeAltitudeFt(ac13 & 0x0FFFU);
    }

    static int decodeSquawkModeA(uint16_t id13)
    {
        auto bitFromLeft = [id13](uint8_t posFromLeft) -> uint8_t {
            return (id13 >> (12U - posFromLeft)) & 1U;
        };

        const int a = (int)bitFromLeft(1) | ((int)bitFromLeft(3) << 1) | ((int)bitFromLeft(5) << 2);
        const int b = (int)bitFromLeft(7) | ((int)bitFromLeft(9) << 1) | ((int)bitFromLeft(11) << 2);
        const int c = (int)bitFromLeft(0) | ((int)bitFromLeft(2) << 1) | ((int)bitFromLeft(4) << 2);
        const int d = (int)bitFromLeft(8) | ((int)bitFromLeft(10) << 1) | ((int)bitFromLeft(12) << 2);

        if (a > 7 || b > 7 || c > 7 || d > 7)
        {
            return -1;
        }
        return a * 1000 + b * 100 + c * 10 + d;
    }

    static char decodeCallsignChar(uint8_t code)
    {
        if (code >= 1 && code <= 26) return (char)('A' + code - 1);
        if (code >= 48 && code <= 57) return (char)('0' + code - 48);
        return ' ';
    }

