MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_ADSB_1090/Arhiv/FlyRf_Base_26_04_28_14/ADSBReceiverESP32.cpp
    static AdsbAircraftState* findAircraftState(uint32_t address)
    {
        for (size_t i = 0; i < kMaxAircraft; ++i)
        {
            if (g_aircraft[i].address == address)
            {
                return &g_aircraft[i];
            }
        }
        return nullptr;
    }

    static AdsbAircraftState* getAircraftState(uint32_t address)
    {
        AdsbAircraftState* emptySlot = nullptr;
        AdsbAircraftState* oldest = &g_aircraft[0];

        for (size_t i = 0; i < kMaxAircraft; ++i)
        {
            if (g_aircraft[i].address == address)
            {
                return &g_aircraft[i];
            }
            if (g_aircraft[i].address == 0 && emptySlot == nullptr)
            {
                emptySlot = &g_aircraft[i];
            }
            if (g_aircraft[i].lastSeenMs < oldest->lastSeenMs)
            {
                oldest = &g_aircraft[i];
            }
        }

        AdsbAircraftState* slot = emptySlot ? emptySlot : oldest;
        memset(slot, 0, sizeof(*slot));
        slot->address = address;
        memset(slot->callsign, ' ', sizeof(slot->callsign));
        return slot;
    }

    static void pulseOkPin()
    {
        digitalWrite(ADSB_ESP32_OK_PULSE_PIN, LOW);
        delayMicroseconds(80);
        digitalWrite(ADSB_ESP32_OK_PULSE_PIN, HIGH);
    }

    static bool hasConfirmedLow20Alias(const AdsbAircraftState& aircraft)
    {
        if (aircraft.crcConfirmed)
        {
            return false;
        }

        const uint32_t low20 = aircraft.address & 0x0FFFFFUL;
        for (size_t i = 0; i < kMaxAircraft; ++i)
        {
            const AdsbAircraftState& other = g_aircraft[i];
            if (other.address != 0 && other.address != aircraft.address && other.crcConfirmed &&
                ((other.address & 0x0FFFFFUL) == low20))
            {
                return true;
            }
        }
        return false;
    }

    static void clearContainerAddress(uint32_t address)
    {
        const uint32_t maskedAddress = address & 0xFFFFFFUL;
        for (int i = 0; i < MAX_TRACKING_OBJECTS; ++i)
        {
            if ((Container[i].addr & 0xFFFFFFUL) == maskedAddress)
            {
                Container[i] = EmptyFO;
            }
        }
    }

    static void clearUnconfirmedLow20Aliases(uint32_t confirmedAddress)
    {
        const uint32_t low20 = confirmedAddress & 0x0FFFFFUL;
        for (size_t i = 0; i < kMaxAircraft; ++i)
        {
            AdsbAircraftState& other = g_aircraft[i];
            if (other.address != 0 && other.address != confirmedAddress && !other.crcConfirmed &&
                ((other.address & 0x0FFFFFUL) == low20))
            {
                clearContainerAddress(other.address);
                memset(&other, 0, sizeof(other));
            }
        }
    }

    static bool noteCrcConfirmedFrame(AdsbAircraftState& aircraft, uint32_t nowMs)
    {
        aircraft.lastCrcMs = nowMs;
        if (aircraft.crcConfirmed)
        {
            return true;
        }

        if (hasConfirmedLow20Alias(aircraft))
        {
            ++g_diag.aliasSuppressed;
            clearContainerAddress(aircraft.address);
            memset(&aircraft, 0, sizeof(aircraft));
            return false;
        }

        if (aircraft.crcFirstSeenMs == 0U || (nowMs - aircraft.crcFirstSeenMs) > kCrcConfirmWindowMs)
        {
            aircraft.crcFirstSeenMs = nowMs;
            aircraft.crcHitCount = 1U;
        }
        else if (aircraft.crcHitCount < 255U)
        {
            ++aircraft.crcHitCount;
        }

        if (aircraft.crcHitCount >= kCrcConfirmHits)
        {
            aircraft.crcConfirmed = true;
            clearUnconfirmedLow20Aliases(aircraft.address);
            return true;
        }

        ++g_diag.crcPending;
        return false;
    }

    static bool aircraftAcceptsAddressParity(const AdsbAircraftState& aircraft, uint32_t nowMs)
    {
        return aircraft.crcConfirmed && aircraft.lastCrcMs != 0U && ((nowMs - aircraft.lastCrcMs) <= kApTrustWindowMs);
    }

    static void pushAircraftToContainer(const AdsbAircraftState& aircraft)
    {
        if (aircraft.address == 0)
        {
            return;
        }

        if (hasConfirmedLow20Alias(aircraft))
        {
            ++g_diag.aliasSuppressed;
            return;
        }

        fo = EmptyFO;
        fo.addr = aircraft.address & 0xFFFFFFUL;
        fo.squawk = aircraft.hasSquawk ? (uint16_t)aircraft.squawk : 0U;
        memcpy(fo.callsign, aircraft.callsign, sizeof(fo.callsign));
        fo.altitude = aircraft.hasAltitude ? ((float)aircraft.altitudeFt * 0.3048f) : 0.0f;
        fo.pressure_altitude = fo.altitude;
        fo.speed = aircraft.hasVelocity ? aircraft.speedKts : 0.0f;
        fo.course = aircraft.hasVelocity ? aircraft.courseDeg : 0.0f;
        fo.vert_rate = aircraft.hasVelocity ? aircraft.verticalRateFpm : 0;
        fo.latitude = aircraft.hasPosition ? aircraft.latitude : 0.0f;
        fo.longitude = aircraft.hasPosition ? aircraft.longitude : 0.0f;
        fo.rssi_rp2040 = 0;
        fo.signal_source = TRAFFIC_SOURCE_ADSB_DUMP1090;
        fo.aircraft_type = 1;
        fo.timestamp = (time_t)(millis() / 1000UL);
        fo.timemsg = fo.timestamp;
        Traffic_Update(&fo);
        if (Traffic_Add(&fo))
        {
            ++g_diag.containerUpdates;
        }
    }

    static uint8_t IRAM_ATTR readRxPinFast()
    {
#if ADSB_ESP32_RX_PIN < 32
        return (REG_READ(GPIO_IN_REG) & (1UL << ADSB_ESP32_RX_PIN)) ? 1U : 0U;
#else
        return (REG_READ(GPIO_IN1_REG) & (1UL << (ADSB_ESP32_RX_PIN - 32))) ? 1U : 0U;
#endif
    }

    static uint32_t IRAM_ATTR cpuCyclesNow()
    {
        return (uint32_t)XTHAL_GET_CCOUNT();
    }

    static void IRAM_ATTR waitUntilCycle(uint32_t targetCycle)
    {
        while ((int32_t)(cpuCyclesNow() - targetCycle) < 0)
        {
        }
    }

    static void IRAM_ATTR sampleSlotsFromRise(uint32_t riseCycle, uint8_t phaseSlots[kPhaseCount][kMaxSlots], size_t slotCount)
    {
        uint32_t centerCycle = riseCycle + g_cyclesPerQuarterUs;
        const uint32_t stepCycles = g_cyclesPerHalfUs;
        uint32_t phaseDelta = g_cyclesPerHalfUs / 4U;
        if (phaseDelta == 0U)
        {
            phaseDelta = 1U;
        }

