MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_ADSB_1090/Arhiv/FlyRf_Base_26_04_28_14/ADSBReceiverESP32.cpp
        for (size_t i = 0; i < slotCount; ++i)
        {
            waitUntilCycle(centerCycle - phaseDelta);
            phaseSlots[0][i] = readRxPinFast();
            waitUntilCycle(centerCycle);
            phaseSlots[kPhaseCenter][i] = readRxPinFast();
            waitUntilCycle(centerCycle + phaseDelta);
            phaseSlots[2][i] = readRxPinFast();
            centerCycle += stepCycles;
        }
    }

    static uint8_t preambleMismatchesAt(const uint8_t* slots, size_t offset, size_t slotCount)
    {
        static const uint8_t kPreamble[16] = {
            1, 0, 1, 0, 0, 0, 0, 1,
            0, 1, 0, 0, 0, 0, 0, 0
        };

        if (offset + sizeof(kPreamble) > slotCount)
        {
            return 255U;
        }

        uint8_t mismatches = 0;
        for (size_t i = 0; i < sizeof(kPreamble); ++i)
        {
            if (slots[offset + i] != kPreamble[i])
            {
                ++mismatches;
            }
        }
        return mismatches;
    }

    static int findPreamble(const uint8_t* slots, size_t slotCount, uint8_t* outMismatches)
    {
        if (slotCount < kPreambleSlots)
        {
            return -1;
        }

        int bestOffset = -1;
        uint8_t bestMismatches = 255U;
        const size_t maxSearchOffset = ((slotCount - kPreambleSlots) > 32U) ? 32U : (slotCount - kPreambleSlots);
        for (size_t offset = 0; offset <= maxSearchOffset; ++offset)
        {
            const uint8_t mismatches = preambleMismatchesAt(slots, offset, slotCount);
            if (mismatches < bestMismatches)
            {
                bestMismatches = mismatches;
                bestOffset = (int)offset;
                if (mismatches == 0U)
                {
                    break;
                }
            }
        }

        if (bestMismatches > 1U)
        {
            return -1;
        }
        if (outMismatches != nullptr)
        {
            *outMismatches = bestMismatches;
        }
        return bestOffset;
    }

    static bool decodeBitPair(const uint8_t* slots, size_t bitSlot, bool& bit)
    {
        const uint8_t first = slots[bitSlot];
        const uint8_t second = slots[bitSlot + 1];
        if (first == 1 && second == 0)
        {
            bit = true;
            return true;
        }
        if (first == 0 && second == 1)
        {
            bit = false;
            return true;
        }
        return false;
    }

    static bool decodeBitsToBytes(const uint8_t* slots, size_t dataStartSlot, uint8_t bitLen, uint8_t* outBytes)
    {
        memset(outBytes, 0, 14);
        for (uint8_t i = 0; i < bitLen; ++i)
        {
            bool bit = false;
            if (!decodeBitPair(slots, dataStartSlot + (size_t)i * 2U, bit))
            {
                return false;
            }
            if (bit)
            {
                outBytes[i / 8] |= (uint8_t)(0x80U >> (i & 7));
            }
        }
        return true;
    }

    static bool decodeModeSFrame(const uint8_t* slots, size_t slotCount, uint8_t phase, DecodedModeSFrame& frame)
    {
        uint8_t preambleMismatches = 0;
        const int preambleOffset = findPreamble(slots, slotCount, &preambleMismatches);
        if (preambleOffset < 0)
        {
            return false;
        }

        const size_t dataStartSlot = (size_t)preambleOffset + 16U;
        if (dataStartSlot + 10U > slotCount)
        {
            return false;
        }

        uint8_t df = 0;
        for (uint8_t i = 0; i < 5; ++i)
        {
            bool bit = false;
            if (!decodeBitPair(slots, dataStartSlot + (size_t)i * 2U, bit))
            {
                return false;
            }
            df = (uint8_t)((df << 1) | (bit ? 1U : 0U));
        }

        const uint8_t bitLen = isLongDf(df) ? 112U : 56U;
        if (dataStartSlot + (size_t)bitLen * 2U > slotCount)
        {
            return false;
        }

        memset(&frame, 0, sizeof(frame));
        if (!decodeBitsToBytes(slots, dataStartSlot, bitLen, frame.bytes))
        {
            return false;
        }

        frame.df = df;
        frame.bitLen = bitLen;
        frame.byteLen = bitLen / 8U;
        frame.phase = phase;
        frame.preambleOffset = (uint8_t)preambleOffset;
        frame.preambleMismatches = preambleMismatches;
        const uint32_t calculated = crc24Bytes(frame.bytes, frame.byteLen - 3U);
        const uint32_t parity = ((uint32_t)frame.bytes[frame.byteLen - 3U] << 16) |
                                ((uint32_t)frame.bytes[frame.byteLen - 2U] << 8) |
                                (uint32_t)frame.bytes[frame.byteLen - 1U];
        frame.syndrome = calculated ^ parity;
        frame.crcSelfValid = (frame.syndrome == 0);
        frame.addressParityValid = isAddressParityDf(frame.df) && frame.syndrome != 0;

        if (frame.addressParityValid)
        {
            frame.address = frame.syndrome & 0xFFFFFFUL;
        }
        else if (frame.df == 11)
        {
            frame.address = ((uint32_t)frame.bytes[1] << 16) | ((uint32_t)frame.bytes[2] << 8) | frame.bytes[3];
        }
        else if (frame.bitLen == 112)
        {
            frame.address = ((uint32_t)frame.bytes[1] << 16) | ((uint32_t)frame.bytes[2] << 8) | frame.bytes[3];
        }
        else
        {
            frame.address = frame.syndrome;
        }

        return true;
    }

    static uint8_t phasePenalty(uint8_t phase)
    {
        return (phase == kPhaseCenter) ? 0U : 1U;
    }

    static uint16_t frameRank(const DecodedModeSFrame& frame)
    {
        uint16_t rank = frame.crcSelfValid ? 0U : (frame.addressParityValid ? 100U : 300U);
        rank += (uint16_t)frame.preambleMismatches * 10U;
        rank += phasePenalty(frame.phase);
        return rank;
    }

    static bool decodeBestModeSFrame(uint8_t phaseSlots[kPhaseCount][kMaxSlots], size_t slotCount, DecodedModeSFrame& frame)
    {
        static const uint8_t kPhaseOrder[kPhaseCount] = {kPhaseCenter, 0, 2};

        bool haveCandidate = false;
        DecodedModeSFrame best = {};
        uint16_t bestRank = 0xFFFFU;
        for (uint8_t i = 0; i < kPhaseCount; ++i)
        {
            const uint8_t phase = kPhaseOrder[i];
            DecodedModeSFrame candidate = {};
            if (!decodeModeSFrame(phaseSlots[phase], slotCount, phase, candidate))
            {
                continue;
            }

            const uint16_t rank = frameRank(candidate);
            if (!haveCandidate || rank < bestRank)
            {
                best = candidate;
                bestRank = rank;
                haveCandidate = true;
                if (candidate.crcSelfValid && candidate.preambleMismatches == 0U && candidate.phase == kPhaseCenter)
                {
                    break;
                }
            }
        }

        if (!haveCandidate)
        {
            return false;
        }

