MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_ADSB_1090/Arhiv/FlyRf_Base_26_04_28_14/ADSBReceiverESP32.cpp
        frame = best;
        if (frame.phase != kPhaseCenter)
        {
            ++g_diag.multiPhaseUsed;
        }
        return true;
    }

    static void decodeAircraftId(AdsbAircraftState& aircraft, const DecodedModeSFrame& frame)
    {
        for (uint8_t i = 0; i < 8; ++i)
        {
            aircraft.callsign[i] = decodeCallsignChar((uint8_t)getBits(frame.bytes, 40U + (uint16_t)i * 6U, 6));
        }
        aircraft.hasCallsign = true;
    }

    static void decodeAirbornePosition(AdsbAircraftState& aircraft, const DecodedModeSFrame& frame, uint32_t nowMs)
    {
        const uint16_t altField = (uint16_t)getBits(frame.bytes, 40, 12);
        const int altFt = decodeAltitudeFt(altField);
        if (altFt != 0)
        {
            aircraft.altitudeFt = altFt;
            aircraft.hasAltitude = true;
        }

        const bool odd = getBits(frame.bytes, 53, 1) != 0;
        CPRPacket& cpr = odd ? aircraft.odd : aircraft.even;
        cpr.lat = getBits(frame.bytes, 54, 17);
        cpr.lon = getBits(frame.bytes, 71, 17);
        cpr.timestampMs = nowMs;
        cpr.valid = true;

        float lat = 0.0f;
        float lon = 0.0f;
        if (decodeGlobalCPR(aircraft.even, aircraft.odd, lat, lon))
        {
            aircraft.latitude = lat;
            aircraft.longitude = lon;
            aircraft.hasPosition = true;
        }
    }

    static void decodeAirborneVelocity(AdsbAircraftState& aircraft, const DecodedModeSFrame& frame)
    {
        const uint8_t subtype = (uint8_t)getBits(frame.bytes, 37, 3);
        if (subtype == 1 || subtype == 2)
        {
            const int ewPlusOne = (int)getBits(frame.bytes, 46, 10);
            const int nsPlusOne = (int)getBits(frame.bytes, 57, 10);
            if (ewPlusOne > 0 && nsPlusOne > 0)
            {
                float vx = (float)(ewPlusOne - 1);
                float vy = (float)(nsPlusOne - 1);
                if (getBits(frame.bytes, 45, 1) != 0) vx = -vx;
                if (getBits(frame.bytes, 56, 1) != 0) vy = -vy;
                if (subtype == 2)
                {
                    vx *= 4.0f;
                    vy *= 4.0f;
                }

                aircraft.speedKts = sqrtf(vx * vx + vy * vy);
                float course = atan2f(vx, vy) * 57.2957795131f;
                if (course < 0.0f) course += 360.0f;
                aircraft.courseDeg = course;
                aircraft.hasVelocity = true;
            }
        }
        else if (subtype == 3 || subtype == 4)
        {
            const int airspeedPlusOne = (int)getBits(frame.bytes, 57, 10);
            if (airspeedPlusOne > 0)
            {
                aircraft.speedKts = (float)(airspeedPlusOne - 1) * (subtype == 4 ? 4.0f : 1.0f);
                aircraft.courseDeg = (float)getBits(frame.bytes, 46, 10) * 360.0f / 1024.0f;
                aircraft.hasVelocity = true;
            }
        }

        const int verticalRatePlusOne = (int)getBits(frame.bytes, 69, 9);
        if (verticalRatePlusOne > 0)
        {
            int verticalRate = (verticalRatePlusOne - 1) * 64;
            if (getBits(frame.bytes, 68, 1) != 0)
            {
                verticalRate = -verticalRate;
            }
            aircraft.verticalRateFpm = verticalRate;
        }
    }

    static bool ingestExtendedSquitter(const DecodedModeSFrame& frame)
    {
        if (!frame.crcSelfValid || (frame.df != 17 && frame.df != 18 && frame.df != 19) || frame.address == 0)
        {
            return false;
        }

        AdsbAircraftState* aircraft = getAircraftState(frame.address);
        if (aircraft == nullptr)
        {
            return false;
        }

        const uint32_t nowMs = millis();
        aircraft->lastSeenMs = nowMs;
        const bool crcTrusted = noteCrcConfirmedFrame(*aircraft, nowMs);
        if (aircraft->address == 0)
        {
            return true;
        }
        const uint8_t typeCode = (uint8_t)getBits(frame.bytes, 32, 5);
        g_diag.lastTypeCode = typeCode;

        if (frame.df == 17)
        {
            ++g_diag.df17Accepted;
        }

        if (typeCode >= 1 && typeCode <= 4)
        {
            decodeAircraftId(*aircraft, frame);
        }
        else if ((typeCode >= 9 && typeCode <= 18) || (typeCode >= 20 && typeCode <= 22))
        {
            decodeAirbornePosition(*aircraft, frame, nowMs);
        }
        else if (typeCode == 19)
        {
            decodeAirborneVelocity(*aircraft, frame);
        }
        else
        {
            return true;
        }

        if (crcTrusted)
        {
            pushAircraftToContainer(*aircraft);
        }
        return true;
    }

    static bool ingestIdentityReply(const DecodedModeSFrame& frame)
    {
        if (!frame.addressParityValid || (frame.df != 5 && frame.df != 21) || frame.address == 0)
        {
            return false;
        }

        const int squawk = decodeSquawkModeA((uint16_t)getBits(frame.bytes, 19, 13));
        if (squawk < 0)
        {
            return false;
        }

        const uint32_t nowMs = millis();
        AdsbAircraftState* aircraft = findAircraftState(frame.address);
        if (aircraft == nullptr || !aircraftAcceptsAddressParity(*aircraft, nowMs))
        {
            ++g_diag.apSuppressed;
            return false;
        }

        aircraft->lastSeenMs = nowMs;
        aircraft->squawk = squawk;
        aircraft->hasSquawk = true;
        g_diag.lastSquawk = (uint16_t)squawk;
        ++g_diag.apAccepted;
        ++g_diag.squawkAccepted;
        pushAircraftToContainer(*aircraft);
        return true;
    }

    static bool ingestAltitudeReply(const DecodedModeSFrame& frame)
    {
        if (!frame.addressParityValid || (frame.df != 4 && frame.df != 20) || frame.address == 0)
        {
            return false;
        }

        const int altitudeFt = decodeAltitudeModeS13Ft((uint16_t)getBits(frame.bytes, 19, 13));
        if (altitudeFt == 0)
        {
            return false;
        }

        if (altitudeFt < -1200 || altitudeFt > 60000)
        {
            return false;
        }

        const uint32_t nowMs = millis();
        AdsbAircraftState* aircraft = findAircraftState(frame.address);
        if (aircraft == nullptr || !aircraftAcceptsAddressParity(*aircraft, nowMs))
        {
            ++g_diag.apSuppressed;
            return false;
        }

