MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_ADSB_1090/Arhiv/FlyRf_Base_26_04_28_14/ADSBReceiverESP32.cpp
        aircraft->lastSeenMs = nowMs;
        aircraft->altitudeFt = altitudeFt;
        aircraft->hasAltitude = true;
        ++g_diag.apAccepted;
        pushAircraftToContainer(*aircraft);
        return true;
    }

    static bool processSampledSlots(uint8_t phaseSlots[kPhaseCount][kMaxSlots], size_t slotCount)
    {
        DecodedModeSFrame frame = {};
        if (!decodeBestModeSFrame(phaseSlots, slotCount, frame))
        {
            ++g_diag.packetsRejected;
            return false;
        }

        if (!frameParityAccepted(frame))
        {
            ++g_diag.crcRejected;
            ++g_diag.packetsRejected;
            return false;
        }

        bool accepted = false;
        if (frame.df == 17 || frame.df == 18 || frame.df == 19)
        {
            accepted = ingestExtendedSquitter(frame);
        }
        else if (frame.df == 5 || frame.df == 21)
        {
            accepted = ingestIdentityReply(frame);
        }
        else if (frame.df == 4 || frame.df == 20)
        {
            accepted = ingestAltitudeReply(frame);
        }
        else
        {
            accepted = frame.crcSelfValid;
        }

        if (!accepted)
        {
            ++g_diag.packetsRejected;
            return false;
        }

        g_diag.lastDf = frame.df;
        g_diag.lastPacketBits = frame.bitLen;
        g_diag.lastPhase = frame.phase;
        g_diag.lastAddress = frame.address & 0xFFFFFFUL;
        ++g_diag.packetsAccepted;
        g_diag.lastPacketMs = millis();
        pulseOkPin();
        return true;
    }

    static bool captureCandidateSlots(uint8_t phaseSlots[kPhaseCount][kMaxSlots], size_t slotCount)
    {
        uint8_t previous = readRxPinFast();
        const uint32_t startCycle = cpuCyclesNow();
        const uint32_t budgetCycles = g_cyclesPerUs * kPollSliceUs;
        uint32_t previousCycle = cpuCyclesNow();

        while (ADSBReceiverESP32_internalEnabled())
        {
            const uint8_t current = readRxPinFast();
            const uint32_t currentCycle = cpuCyclesNow();
            if (current != 0 && previous == 0)
            {
                const uint32_t riseCycle = previousCycle + ((uint32_t)(currentCycle - previousCycle) / 2U);
                sampleSlotsFromRise(riseCycle, phaseSlots, slotCount);
                return true;
            }
            previous = current;
            previousCycle = currentCycle;

            if ((uint32_t)(currentCycle - startCycle) >= budgetCycles)
            {
                return false;
            }
        }

        return false;
    }

    static bool preambleLooksValid(const uint8_t* slots, size_t slotCount)
    {
        uint8_t preambleMismatches = 0;
        return findPreamble(slots, slotCount, &preambleMismatches) >= 0;
    }

    static bool preambleLooksValidAnyPhase(uint8_t phaseSlots[kPhaseCount][kMaxSlots], size_t slotCount)
    {
        for (uint8_t phase = 0; phase < kPhaseCount; ++phase)
        {
            if (preambleLooksValid(phaseSlots[phase], slotCount))
            {
                return true;
            }
        }
        return false;
    }

#if ADSB_ESP32_HAS_I2S_DMA
    static uint8_t dmaSampleBit(const uint32_t* words, size_t sampleIndex, bool lsbFirst)
    {
        const uint32_t word = words[sampleIndex >> 5U];
        const uint8_t bitIndex = (uint8_t)(sampleIndex & 31U);
        const uint8_t shift = lsbFirst ? bitIndex : (uint8_t)(31U - bitIndex);
        return (word & (1UL << shift)) ? 1U : 0U;
    }

    static bool buildPhaseSlotsFromDma(const uint32_t* words,
                                       size_t sampleCount,
                                       size_t startSample,
                                       bool lsbFirst,
                                       uint8_t phaseSlots[kPhaseCount][kMaxSlots],
                                       size_t slotCount)
    {
        if (kDmaSamplesPerHalfSlot < 2U)
        {
            return false;
        }

        const size_t neededSamples = (slotCount + 1U) * (size_t)kDmaSamplesPerHalfSlot;
        if (startSample + neededSamples >= sampleCount)
        {
            return false;
        }

        const uint8_t center = kDmaSamplesPerHalfSlot / 2U;
        uint8_t delta = kDmaSamplesPerHalfSlot / 4U;
        if (delta == 0U)
        {
            delta = 1U;
        }

        for (size_t slot = 0; slot < slotCount; ++slot)
        {
            const size_t base = startSample + slot * (size_t)kDmaSamplesPerHalfSlot + center;
            phaseSlots[0][slot] = dmaSampleBit(words, base - delta, lsbFirst);
            phaseSlots[kPhaseCenter][slot] = dmaSampleBit(words, base, lsbFirst);
            phaseSlots[2][slot] = dmaSampleBit(words, base + delta, lsbFirst);
        }
        return true;
    }

    static size_t processDmaWords(const uint32_t* words, size_t wordCount, bool lsbFirst)
    {
        if (words == nullptr || wordCount == 0)
        {
            return 0;
        }

        const size_t sampleCount = wordCount * 32U;
        const size_t neededSamples = (size_t)kFullSampleSlots * (size_t)kDmaSamplesPerHalfSlot;
        if (sampleCount <= neededSamples + 2U)
        {
            return 0;
        }

        size_t acceptedCount = 0;
        size_t candidateCount = 0;
        uint8_t phaseSlots[kPhaseCount][kMaxSlots];
        uint8_t previous = dmaSampleBit(words, 0, lsbFirst);
        for (size_t sample = 1; sample + neededSamples + 2U < sampleCount; ++sample)
        {
            const uint8_t current = dmaSampleBit(words, sample, lsbFirst);
            if (current != 0 && previous == 0)
            {
                ++candidateCount;
                if (candidateCount > kDmaMaxCandidatesPerChunk)
                {
                    break;
                }

                if (buildPhaseSlotsFromDma(words, sampleCount, sample, lsbFirst, phaseSlots, kFullSampleSlots))
                {
                    ++g_diag.sampledFrames;
                    g_diag.lastSampleSlots = kFullSampleSlots;
                    if (preambleLooksValidAnyPhase(phaseSlots, kFullSampleSlots))
                    {
                        if (processSampledSlots(phaseSlots, kFullSampleSlots))
                        {
                            ++acceptedCount;
                            sample += neededSamples;
                            previous = 0;
                            continue;
                        }
                    }
                    else
                    {
                        ++g_diag.preambleRejected;
                        ++g_diag.packetsRejected;
                    }
                }
            }
            previous = current;
        }
        return acceptedCount;
    }

    static bool setupDmaCapture()
    {
        if (kDmaSamplesPerHalfSlot < 2U)
        {
            return false;
        }

        i2s_config_t config = {};
        config.mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX);
        config.sample_rate = (int)(kDmaBitRateHz / 32UL);
        config.bits_per_sample = I2S_BITS_PER_SAMPLE_32BIT;
        config.channel_format = I2S_CHANNEL_FMT_ONLY_LEFT;
        config.communication_format = (i2s_comm_format_t)1;
        config.intr_alloc_flags = ESP_INTR_FLAG_LEVEL1;
        config.dma_buf_count = 6;
        config.dma_buf_len = 256;
        config.use_apll = false;
        config.tx_desc_auto_clear = false;
        config.fixed_mclk = 0;

