MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_ADSB_1090/Arhiv/FlyRf_Base_26_04_28_14/ADSBReceiverESP32.cpp
        const i2s_port_t port = (i2s_port_t)0;
        if (i2s_driver_install(port, &config, 0, nullptr) != ESP_OK)
        {
            return false;
        }

        i2s_pin_config_t pins;
        memset(&pins, 0xFF, sizeof(pins));
        pins.bck_io_num = ADSB_ESP32_DMA_BCLK_PIN;
        pins.ws_io_num = ADSB_ESP32_DMA_WS_PIN;
        pins.data_out_num = I2S_PIN_NO_CHANGE;
        pins.data_in_num = ADSB_ESP32_RX_PIN;
        if (i2s_set_pin(port, &pins) != ESP_OK)
        {
            i2s_driver_uninstall(port);
            return false;
        }

        i2s_zero_dma_buffer(port);
        return i2s_start(port) == ESP_OK;
    }

    static void adsbDmaTask(void* param)
    {
        (void)param;
        esp_task_wdt_add(NULL);
        const i2s_port_t port = (i2s_port_t)0;
        uint32_t words[kDmaReadWords];
        uint32_t startMs = millis();
        uint32_t acceptedAtStart = g_diag.packetsAccepted;

        for (;;)
        {
            esp_task_wdt_reset();

            if (!ADSBReceiverESP32_internalEnabled() || !g_dmaCaptureActive)
            {
                vTaskDelay(pdMS_TO_TICKS(100));
                continue;
            }

            size_t bytesRead = 0;
            const esp_err_t rc = i2s_read(port, words, sizeof(words), &bytesRead, pdMS_TO_TICKS(50));
            if (rc != ESP_OK || bytesRead == 0)
            {
                if ((millis() - startMs) > 3000UL)
                {
                    i2s_stop(port);
                    i2s_driver_uninstall(port);
                    g_dmaCaptureActive = false;
                }
                continue;
            }

            const size_t wordCount = bytesRead / sizeof(words[0]);
            processDmaWords(words, wordCount, false);
            vTaskDelay(1);

            if ((millis() - startMs) > 15000UL && g_diag.packetsAccepted == acceptedAtStart)
            {
                i2s_stop(port);
                i2s_driver_uninstall(port);
                g_dmaCaptureActive = false;
            }
        }
    }
#endif

    static void adsbRxTask(void* param)
    {
        (void)param;
        esp_task_wdt_add(NULL);
        g_diag.taskRunning = true;
        uint8_t phaseSlots[kPhaseCount][kMaxSlots];

        for (;;)
        {
            esp_task_wdt_reset();

            if (!ADSBReceiverESP32_internalEnabled())
            {
                vTaskDelay(pdMS_TO_TICKS(50));
                continue;
            }

            if (!captureCandidateSlots(phaseSlots, kFullSampleSlots))
            {
                vTaskDelay(1);
                continue;
            }

            ++g_diag.sampledFrames;
            g_diag.lastSampleSlots = kFullSampleSlots;
            if (!preambleLooksValidAnyPhase(phaseSlots, kFullSampleSlots))
            {
                ++g_diag.preambleRejected;
                ++g_diag.packetsRejected;
                vTaskDelay(1);
                continue;
            }

            processSampledSlots(phaseSlots, kFullSampleSlots);
            vTaskDelay(1);
        }
    }

    static bool startGpioSamplerTask()
    {
        if (g_adsbTask != nullptr)
        {
            return true;
        }

        const BaseType_t rc = xTaskCreatePinnedToCore(adsbRxTask, "ADSB1090", 8192, nullptr, 4, &g_adsbTask, 0);
        if (rc != pdPASS)
        {
            g_diag.ready = false;
            g_adsbTask = nullptr;
            return false;
        }
        return true;
    }

    static bool startDmaCaptureTask()
    {
#if ADSB_ESP32_HAS_I2S_DMA
        if (g_dmaTask != nullptr)
        {
            g_dmaCaptureActive = true;
            return true;
        }

        if (!setupDmaCapture())
        {
            g_dmaCaptureActive = false;
            return false;
        }

        g_dmaCaptureActive = true;
        const BaseType_t rc = xTaskCreatePinnedToCore(adsbDmaTask, "ADSB1090DMA", 8192, nullptr, 2, &g_dmaTask, 0);
        if (rc != pdPASS)
        {
            g_dmaCaptureActive = false;
            g_dmaTask = nullptr;
            i2s_driver_uninstall((i2s_port_t)0);
            return false;
        }
        return true;
#else
        return false;
#endif
    }
}

bool ADSBReceiverESP32_internalEnabled()
{
    return settings != nullptr && settings->adsb_receiver == ADSB_RECEIVER_INTERNAL;
}

uint16_t ADSBReceiverESP32_thresholdPwmDuty()
{
    return thresholdSettingToDuty();
}

void ADSBReceiverESP32_applySettings()
{
    const uint16_t duty = thresholdSettingToDuty();
    if (!setupThresholdPwm())
    {
        return;
    }
    if (duty == g_lastThresholdPwmDuty)
    {
        return;
    }

    writeThresholdPwm(duty);
    g_lastThresholdPwmDuty = duty;
    g_diag.thresholdPwmDuty = duty;
}

void ADSBReceiverESP32_setup()
{
    memset(&g_diag, 0, sizeof(g_diag));
    memset(g_aircraft, 0, sizeof(g_aircraft));

    const uint32_t cpuMHz = (uint32_t)ESP.getCpuFreqMHz();
    g_cyclesPerUs = (cpuMHz > 0U) ? cpuMHz : 240UL;
    g_cyclesPerHalfUs = (g_cyclesPerUs > 1U) ? (g_cyclesPerUs / 2U) : 120UL;
    if (g_cyclesPerHalfUs == 0)
    {
        g_cyclesPerHalfUs = 120UL;
    }
    g_cyclesPerQuarterUs = g_cyclesPerHalfUs / 2U;
    if (g_cyclesPerQuarterUs == 0)
    {
        g_cyclesPerQuarterUs = 1U;
    }
    pinMode(ADSB_ESP32_RX_PIN, INPUT_PULLDOWN);
    pinMode(ADSB_ESP32_OK_PULSE_PIN, OUTPUT);
    digitalWrite(ADSB_ESP32_OK_PULSE_PIN, HIGH);
    ADSBReceiverESP32_applySettings();

    g_diag.ready = true;
    if (!startDmaCaptureTask())
    {
        startGpioSamplerTask();
    }
}

void ADSBReceiverESP32_loop()
{
    static uint32_t lastSettingsApplyMs = 0;
    const uint32_t nowMs = millis();

    if ((nowMs - lastSettingsApplyMs) >= 500UL)
    {
        lastSettingsApplyMs = nowMs;
        ADSBReceiverESP32_applySettings();
    }

    if (ADSBReceiverESP32_internalEnabled() && !g_dmaCaptureActive && g_adsbTask == nullptr)
    {
        startGpioSamplerTask();
    }
}

bool ADSBReceiverESP32_getDiag(ADSBReceiverESP32Diag& outDiag)
{
    outDiag = g_diag;
    outDiag.thresholdPwmDuty = ADSBReceiverESP32_thresholdPwmDuty();
    return g_diag.ready;
}
